# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Mon Dec 05 07:11:03 UTC 2022

# ####################################################################

set sdc_version 1.1


# Set the current design
current_design RISC_V_pipeline

create_clock -name "clk_pad" -period 9.2 -waveform {0.0 4.6} [get_ports clk_pad]
set_clock_transition -rise -min 0.03 [get_clocks clk_pad]
set_clock_transition -rise -max 0.05 [get_clocks clk_pad]
set_clock_transition -fall -min 0.04 [get_clocks clk_pad]
set_clock_transition -fall -max 0.05 [get_clocks clk_pad]
set_load -pin_load 0.005 [get_ports {gpio_port_out_pad[7]}]
set_load -pin_load 0.005 [get_ports {gpio_port_out_pad[6]}]
set_load -pin_load 0.005 [get_ports {gpio_port_out_pad[5]}]
set_load -pin_load 0.005 [get_ports {gpio_port_out_pad[4]}]
set_load -pin_load 0.005 [get_ports {gpio_port_out_pad[3]}]
set_load -pin_load 0.005 [get_ports {gpio_port_out_pad[2]}]
set_load -pin_load 0.005 [get_ports {gpio_port_out_pad[1]}]
set_load -pin_load 0.005 [get_ports {gpio_port_out_pad[0]}]
set_load -pin_load 0.005 [get_ports uart_tx_pad]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports reset_pad]
set_input_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_in_pad[7]}]
set_input_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_in_pad[6]}]
set_input_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_in_pad[5]}]
set_input_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_in_pad[4]}]
set_input_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_in_pad[3]}]
set_input_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_in_pad[2]}]
set_input_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_in_pad[1]}]
set_input_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_in_pad[0]}]
set_input_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports uart_rx_pad]
set_output_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_out_pad[7]}]
set_output_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_out_pad[6]}]
set_output_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_out_pad[5]}]
set_output_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_out_pad[4]}]
set_output_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_out_pad[3]}]
set_output_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_out_pad[2]}]
set_output_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_out_pad[1]}]
set_output_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports {gpio_port_out_pad[0]}]
set_output_delay -clock [get_clocks clk_pad] -add_delay 0.2 [get_ports uart_tx_pad]
set_max_fanout 15.000 [current_design]
set_max_transition 0.02 [current_design]
set_max_capacitance 0.005 [get_ports {gpio_port_out_pad[7]}]
set_max_capacitance 0.005 [get_ports {gpio_port_out_pad[6]}]
set_max_capacitance 0.005 [get_ports {gpio_port_out_pad[5]}]
set_max_capacitance 0.005 [get_ports {gpio_port_out_pad[4]}]
set_max_capacitance 0.005 [get_ports {gpio_port_out_pad[3]}]
set_max_capacitance 0.005 [get_ports {gpio_port_out_pad[2]}]
set_max_capacitance 0.005 [get_ports {gpio_port_out_pad[1]}]
set_max_capacitance 0.005 [get_ports {gpio_port_out_pad[0]}]
set_max_capacitance 0.005 [get_ports uart_tx_pad]
set_max_capacitance 0.005 [get_ports VDD1]
set_max_capacitance 0.005 [get_ports VDD2]
set_max_capacitance 0.005 [get_ports VSS1]
set_max_capacitance 0.005 [get_ports VSS2]
set_max_capacitance 0.005 [get_ports VSS3]
set_max_capacitance 0.005 [get_ports VDDIOR]
set_max_capacitance 0.005 [get_ports VSSIOR]
set_clock_latency  -rise 0.01 [get_clocks clk_pad]
set_clock_latency  -fall 0.015 [get_clocks clk_pad]
set_clock_latency -source -rise 0.02 [get_clocks clk_pad]
set_clock_latency -source -fall 0.03 [get_clocks clk_pad]
set_clock_uncertainty -setup 0.008 [get_clocks clk_pad]
set_clock_uncertainty -hold 0.004 [get_clocks clk_pad]
