# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name RC_Corner_WC -T {125} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0} -qx_tech_file {/CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/qrc/qx/gpdk045.tch}
create_rc_corner -name RC_Corner_BC -T {0} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0} -qx_tech_file {/CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/qrc/qx/gpdk045.tch}
create_library_set -name Lib_Set_WC -timing {/CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/timing/slow_vdd1v0_basicCells.lib /CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/timing/slow_vdd1v0_multibitsDFF.lib /users/iteso-s005/models/E11_final_synthesis/genus/Adders_Pad_Frame_genus_gio_libs_C/GPDK045_gio_lib/pads_SS_s1vg.lib}
create_library_set -name Lib_Set_BC -timing {/CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/timing/fast_vdd1v2_basicCells.lib /CMC/kits/cadence/GPDK045/gsclib045_all_v4.4/gsclib045/timing/fast_vdd1v2_multibitsDFF.lib /users/iteso-s005/models/E11_final_synthesis/genus/Adders_Pad_Frame_genus_gio_libs_C/GPDK045_gio_lib/pads_FF_s1vg.lib}
create_constraint_mode -name Constraint_Mode_WC -sdc_files {../synthesis_genus/outputs/RISC_V_pipeline_opt.CM_riscv_pipe_slow.sdc}
create_constraint_mode -name Constraint_Mode_BC -sdc_files {../synthesis_genus/outputs/RISC_V_pipeline_opt.CM_riscv_pipe_fast.sdc}
create_delay_corner -name Delay_Corner_WC -library_set {Lib_Set_WC} -rc_corner {RC_Corner_BC}
create_delay_corner -name Delay_Corner_BC -library_set {Lib_Set_BC} -rc_corner {RC_Corner_BC}
create_analysis_view -name Analysis_View_WC -constraint_mode {Constraint_Mode_WC} -delay_corner {Delay_Corner_WC}
create_analysis_view -name Analysis_View_BC -constraint_mode {Constraint_Mode_BC} -delay_corner {Delay_Corner_BC}
set_analysis_view -setup {Analysis_View_WC} -hold {Analysis_View_BC}
